# FabricationRodDetachFromHangerError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..FabricationRodDetachFromHangerError Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
The rod need to be detached from hanger.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FabricationRodDetachFromHangerError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationRodDetachFromHangerError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FabricationRodDetachFromHangerError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace